
#include <iostream>//подключаем библиотеку
#include <math.h>//подключаем математическую библиотеку
using namespace std;//стандартное пространствоимен
int main() //начало функции
{
    double x1,y1,x2,y2,x3,y3,a,b,c,p;//объявление переменных
    cout << "Введи координаты 1 точки:"<<endl;//ввод команды
    cin>> x1>> y1;//вводим
    cout << "Введи координаты 2 точки:"<<endl;//ввод команды
    cin>> x2>> y2;//вводим
    cout << "Введи координаты 3 точки:"<<endl;//ввод команды
    cin>> x3 >> y3;//вводим
    a=sqrt(pow(x2-x1,2)+sqrt(pow(y2-y1,2)));//считаем сторону1
    b=sqrt(pow(x3-x2,2)+sqrt(pow(y3-y2,2)));//считаем сторону2
    c=sqrt(pow(x1-x3,2)+sqrt(pow(y1-y3,2)));//считаем сторону3
    cout<<"Периметр:"<<a+b+c<<endl;
    p=(a+b+c)/2;//полупериметр
    cout<<"Площадь:"<<sqrt(p*(p-a)*(p-b)*(p-c))<<endl;
    return 0;
}
